# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'yq'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'htop'

# Development
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'redis'
brew 'activemq'
brew 'ack'
brew 'tree'
brew 'tmux'
brew 'watchman'
brew 'wget'
brew 'tig'
brew 'redis'

# Languages
brew 'java'
brew 'maven'
brew 'go'
brew 'gradle'
brew 'node'
brew 'nvm'
brew 'yarn'
brew 'python@3.9'

# Kubernetes
brew 'podman'
brew 'kubectx'
brew 'ansible'
brew 'helm'
brew 'skopeo'
brew 'tektoncd-cli'

# Apps
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'miro'
cask 'github'
cask 'imageoptim'
cask 'insomnia'
cask 'pastebot'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'intellij-idea'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Spring', id: 1508706541
# mas 'Things', id: 904280696
